Autodesk.Revit.DB.DWGImportOptions.GetLineWeights
Gets array of line weights.
Since:
2013

Autodesk.Revit.DB.DWGImportOptions.SetLineWeights(System.Collections.Generic.IList{System.Int32})
Set array of line weights.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DWGImportOptions.#ctor(Autodesk.Revit.DB.DWGImportOptions)
Constructs a new instance of DWGImportOptions as a copy of the import options.
option:
The options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DWGImportOptions.#ctor
Constructs a new instance of DWGImportOptions with default values of all properties.
Since:
2013

Autodesk.Revit.DB.DWGImportOptions
The import options used by importing DWG or DXF format file.
Since:
2013